БИТУправление_медицинским_центром_демо/src/InformationRegisters/ВыполнениеЭтаповКомплексногоРасчета/ВыполнениеЭтаповКомплексногоРасчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВыполнениеЭтаповКомплексногоРасчета</name>
  <resources>
    <name>Выполнен</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсполнительФакт</name>
    <type>
      <types>DefinedType.ИсполнителиЭтаповКомплексногоРасчета</types>
    </type>
  </attributes>
  <dimensions>
    <name>КомплексныйРасчет</name>
    <type>
      <types>DefinedType.КомплексныйРасчетКлиента</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторЭтапа</name>
    <type>
      <types>DefinedType.УникальныйИдентификаторСтрокой</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументРегистратор</name>
    <type>
      <types>DefinedType.ДокументыВыполненияЭтаповКомплексногоРасчета</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БИТУправление_медицинским_центром_демо/src/Documents/КомплексныйРасчетКлиента/КомплексныйРасчетКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КомплексныйРасчетКлиента</name>
  <registerRecords>AccumulationRegister.НоменклатураКомплексныхРасчетовКлиентов</registerRecords>
  <registerRecords>AccumulationRegister.ВыработкаСотрудников</registerRecords>
  <registerRecords>AccumulationRegister.ПартииТоваровНаСкладах</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Вид</name>
    <type>
      <types>CatalogRef.ВидыКомплексныхРасчетовКлиентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Прейскурант</name>
    <type>
      <types>CatalogRef.Прейскуранты</types>
    </type>
  </attributes>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Остановлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопустимыйДолг</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.Прием</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентАванса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИгнорироватьДолг</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаСоСкидкой</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИгнорироватьДолг</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сырье</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Спецификация</name>
    <attributes>
      <name>Параметр</name>
      <type>
        <types>CatalogRef.ПараметрыСпецификаций</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДобавленАвтоматически</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерСтрокиСортировки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЭтапыРабот</name>
    <attributes>
      <name>ИдентификаторЭтапа</name>
      <type>
        <types>DefinedType.УникальныйИдентификаторСтрокой</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ИсполнительПлан</name>
      <type>
        <types>DefinedType.ИсполнителиЭтаповКомплексногоРасчета</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

БИТУправление_медицинским_центром_демо/src/CommonModules/КомплексныеРасчетыКлиентовСервер/Module.bsl
// Процедура - Заполнить этапы работ с отметками выполнения
//
// Параметры:
//  КомплексныйРасчет	 - ДокументСсылка.КомплексныйРасчет - Ссылка на документ расчета
//  ЭтапыРабот			 - ДанныеФормыКоллекция - Таблица, содержащая этапы работ
//  ТекущийДокумент		 - ДокументСсылка.ПередачаЗаказаВМастерскую, ДокументСсылка.ПриемЗаказаИзМастерской, 
//	ДокументСсылка.Прием - Текущий документ, для которого формируется таблица этапов 
//
Процедура ЗаполнитьЭтапыРаботСОтметкамиВыполнения(КомплексныйРасчет, ЭтапыРабот, ТекущийДокумент) Экспорт 
	
	ЭтапыСОтметками = УправлениеЗаказами.ПолучитьТаблицуЭтаповРаботСОтметкамиОВыполнении(КомплексныйРасчет);
	ЭтапыРабот.Очистить();
	Для Каждого СтрокаЭтап Из ЭтапыСОтметками Цикл
		НоваяСтрока = ЭтапыРабот.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаЭтап);
		Если ЗначениеЗаполнено(НоваяСтрока.Выполнен) И НоваяСтрока.ДокументРегистратор = ТекущийДокумент Тогда
			НоваяСтрока.ДокументРегистратор = Неопределено;
			НоваяСтрока.ВыполненВЭтомДокументе = Истина;
		КонецЕсли;
		НоваяСтрока.ВнешнийИсполнитель = (ТипЗнч(НоваяСтрока.ИсполнительПлан) = Тип("СправочникСсылка.Контрагенты"));
		ТипИсполнителя = Новый ОписаниеТипов(?(НоваяСтрока.ВнешнийИсполнитель, 
			"СправочникСсылка.Контрагенты", "СправочникСсылка.Сотрудники"));
		НоваяСтрока.ИсполнительФакт = ТипИсполнителя.ПривестиЗначение(НоваяСтрока.ИсполнительФакт);
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьВыполненныхЭтаповРаботИзТаблицы(ЭтапыРабот) Экспорт
	
	ВыполненныеЭтапы = Новый Массив;
	Для Каждого СтрокаЭтап Из 
		ЭтапыРабот.НайтиСтроки(Новый Структура("ОтметкаВыполнения, ВыполненВЭтомДокументе", Истина, Истина)) 
	Цикл
		ВыполненныеЭтапы.Добавить(
			Новый Структура("ИдентификаторЭтапа, Выполнен, ИсполнительФакт, Пользователь",
			СтрокаЭтап.ИдентификаторЭтапа, СтрокаЭтап.Выполнен, СтрокаЭтап.ИсполнительФакт, СтрокаЭтап.Пользователь));
	КонецЦикла;
	
	Возврат ВыполненныеЭтапы;
	
КонецФункции

Процедура ВыполнитьДвиженияПоВыработкеСотрудниковПоВыполненнымЭтапам(ДокументОбъект, Отказ) Экспорт 
	
	Если ДокументОбъект.Движения.Найти("ВыработкаСотрудников") = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ДокументОбъект.Движения.ВыработкаСотрудников.Записывать = Истина;
	НаборДвижений = ДокументОбъект.Движения.ВыработкаСотрудников;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВыполнениеЭтаповКомплексногоРасчета.ИсполнительФакт КАК Сотрудник,
	|	ВыполнениеЭтаповКомплексногоРасчета.ДокументРегистратор.Филиал КАК Филиал,
	|	ВыполнениеЭтаповКомплексногоРасчета.КомплексныйРасчет,
	|	ВыполнениеЭтаповКомплексногоРасчета.ИдентификаторЭтапа
	|ПОМЕСТИТЬ ВыполненныеЭтапыПоДокументу
	|ИЗ
	|	РегистрСведений.ВыполнениеЭтаповКомплексногоРасчета КАК ВыполнениеЭтаповКомплексногоРасчета
	|ГДЕ
	|	ВыполнениеЭтаповКомплексногоРасчета.ДокументРегистратор = &ДокументВыполнения
	|	И ВыполнениеЭтаповКомплексногоРасчета.ИсполнительФакт ССЫЛКА Справочник.Сотрудники
	|			И ВыполнениеЭтаповКомплексногоРасчета.ИсполнительФакт <> ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВыполненныеЭтапыПоДокументу.Сотрудник,
	|	ВыполненныеЭтапыПоДокументу.Филиал,
	|	КомплексныйРасчетКлиентаЭтапыРабот.Номенклатура,
	|	КомплексныйРасчетКлиентаЭтапыРабот.Номенклатура.ПродолжительностьЧас * 3600 + КомплексныйРасчетКлиентаЭтапыРабот.Номенклатура.ПродолжительностьМин * 60 КАК Продолжительность
	|ИЗ
	|	ВыполненныеЭтапыПоДокументу КАК ВыполненныеЭтапыПоДокументу
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КомплексныйРасчетКлиента.ЭтапыРабот КАК КомплексныйРасчетКлиентаЭтапыРабот
	|		ПО ВыполненныеЭтапыПоДокументу.КомплексныйРасчет = КомплексныйРасчетКлиентаЭтапыРабот.Ссылка
	|			И ВыполненныеЭтапыПоДокументу.ИдентификаторЭтапа = КомплексныйРасчетКлиентаЭтапыРабот.ИдентификаторЭтапа";
	Запрос.УстановитьПараметр("ДокументВыполнения", ДокументОбъект.Ссылка);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Движение = НаборДвижений.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, Выборка);
		Движение.Период = ДокументОбъект.Дата;
		Движение.Количество = 1;
		
	КонецЦикла;
	
КонецПроцедуры
